###################################################################

# Created by write_sdc on Sat Feb 20 20:45:31 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {I_MEM_address[31]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[30]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[29]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[28]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[27]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[26]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[25]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[24]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[23]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[22]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[21]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[20]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[19]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[18]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[17]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[16]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[15]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[14]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[13]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[12]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[11]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[10]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[9]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[8]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[7]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[6]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[5]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[4]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[3]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[2]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[1]}]
set_load -pin_load 3.40189 [get_ports {I_MEM_address[0]}]
set_load -pin_load 3.40189 [get_ports D_MEM_WE]
set_load -pin_load 3.40189 [get_ports D_MEM_RE]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[31]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[30]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[29]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[28]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[27]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[26]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[25]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[24]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[23]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[22]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[21]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[20]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[19]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[18]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[17]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[16]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[15]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[14]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[13]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[12]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[11]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[10]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[9]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[8]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[7]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[6]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[5]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[4]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[3]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[2]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[1]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_address[0]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[31]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[30]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[29]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[28]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[27]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[26]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[25]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[24]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[23]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[22]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[21]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[20]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[19]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[18]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[17]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[16]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[15]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[14]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[13]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[12]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[11]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[10]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[9]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[8]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[7]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[6]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[5]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[4]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[3]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[2]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[1]}]
set_load -pin_load 3.40189 [get_ports {D_MEM_write[0]}]
create_clock [get_ports RISC_CLK]  -name MY_CLK  -period 1.2  -waveform {0 0.6}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RISC_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RISC_RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_read[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_read[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {I_MEM_address[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports D_MEM_WE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports D_MEM_RE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_address[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_MEM_write[0]}]
